###############################################################
#  Generated by:      Cadence Innovus 16.16-s054_1
#  OS:                Linux x86_64(Host ID cad-slac.stanford.edu)
#  Generated on:      Sun Jun 30 19:59:29 2019
#  Design:            ssp_enc12b14b_ext
#  Command:           saveDesign ../output/route.enc
###############################################################
current_design ssp_enc12b14b_ext
create_clock [get_ports {clk_i}]  -name clk_i -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_clocks {clk_i}]
set_propagated_clock  [get_ports {clk_i}]
